app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."author_id" = ?  [["author_id", 2]]
---
	def index
		@articles = Article.where(author_id: current_user.id)

INSERT INTO "articles" ("title", "body", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test7"], ["body", "hello"], ["author_id", 2], ["created_at", "2018-07-25 07:53:50.201522"], ["updated_at", "2018-07-25 07:53:50.201522"]]
---
	def create
		@article = Article.new(article_params)
		@article.author_id = current_user.id if current_user
		@article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 21]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "This is the new title."], ["updated_at", "2018-07-23 06:13:26.340997"], ["id", 15]]
---
	def update
		@article = Article.find(params[:id])
		if params[:article][:new_tag_list].nil?
			@article.update(article_params)