app/controllers/authors_controller.rb

  def index
    if login(params[:email], params[:password])
      @authors = Author.where(id: current_user.id)
      redirect_to author_path
    else
      @authors = Author.all
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 3]]
SELECT "authors".* FROM "authors"

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "test1"], ["email", "test1@admin.com"], ["created_at", "2018-07-23 09:26:11.785760"], ["updated_at", "2018-07-23 09:26:11.785760"]]

  def destroy
    @author.destroy
---
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 1]]