app/controllers/taggings_controller.rb

	def destroy
		# puts 'mohsin'
		# puts params[:article_id]
		# puts params[:tag_id]
		@taggings = Tagging.where(tag_id: params[:tag_id]).where(article_id: params[:article_id])
		@taggings.first.destroy
---
SELECT  "taggings".* FROM "taggings" WHERE "taggings"."tag_id" = ? AND "taggings"."article_id" = ?  ORDER BY "taggings"."id" ASC LIMIT 1  [["tag_id", 10], ["article_id", 14]]
DELETE FROM "taggings" WHERE "taggings"."id" = ?  [["id", 10]]
SELECT  "taggings".* FROM "taggings" WHERE "taggings"."article_id" = ? AND "taggings"."id" = ? LIMIT 1  [["article_id", 14], ["id", 10]]