app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
	def index
		@tag = Tag.all

DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 4]]
---
	def destroy
		@tag = Tag.taggings.first
		@tag.destroy